{
    "resourceType": "ValueSet",
    "id": "skinpinch",
    "url": "https://fhir.dk.swisstph-mis.ch/matchbox/fhir/ValueSet/skinpinch",
    "name": "valueset-skinpinch",
    "title": "Skin pinch of Abdomen",
    "status": "draft",
    "experimental": false,
    "description": "Locate the area on the infant’s abdomen halfway between the umbilicus and the side of the abdomen. To do the skin pinch, use your thumb and first finger. Do not use your fingertips because this will cause pain. Place \nyour hand so that when you pinch the skin, the fold of skin will be in a line up and down the child’s body and not across the child’s \nbody. Firmly pick up all of the layers of skin and the tissue under them. Pinch the skin for \none second and then release it. When you release the skin, look to see if the skin pinch \ngoes back:\n• immediately\n• slowly (2 seconds or fewer, but not immediately)\n• very slowly (longer than 2 seconds)\nIf the skin stays up for even a brief time after you release it, decide that the skin pinch goes back slowly",
    "immutable": true,
    "compose": {
        "include": [
            {
                "system": "https://fhir.dk.swisstph-mis.ch/matchbox/fhir/CodeSystem/che-custom-codes",
                "concept": [
                    {
                        "code": "CHE.B20S2.DE05",
                        "display": "Goes back Normally (immediately)",
                        "designation": [
                            {
                                "value": "The young infant's skin goes back normally after skin pinch of abdomen (immediately)"
                            }
                        ]
                    },
                    {
                        "code": "CHE.B20S2.DE04",
                        "display": "Goes back slowly (2 seconds or fewer, but not immediately)",
                        "designation": [
                            {
                                "value": "The young infant's skin goes back slowly after skin pinch of abdomen (2 seconds or fewer, but not immediately)"
                            }
                        ]
                    },
                    {
                        "code": "CHE.B20S2.DE03",
                        "display": "Goes back very slowly (More than 2 seconds)",
                        "designation": [
                            {
                                "value": "The young infant's skin goes back very slowly after skin pinch of abdomen (More than 2 seconds)"
                            }
                        ]
                    }
                ]
            }
        ]
    }
}