{
    "resourceType": "ValueSet",
    "id": "personas",
    "url": "https://fhir.dk.swisstph-mis.ch/matchbox/fhir/ValueSet/personas",
    "name": "valueset-personas",
    "title": "Personas",
    "status": "draft",
    "experimental": false,
    "description": "Codes representing possible values for the Provide an estimated age or estimated date of birth element",
    "immutable": true,
    "compose": {
        "include": [
            {
                "system": "https://fhir.dk.swisstph-mis.ch/matchbox/fhir/CodeSystem/che-custom-codes",
                "concept": [
                    {
                        "code": "CHE.NP",
                        "display": "Nursing Professional",
                        "designation": [
                            {
                                "value": "Nursing professionals provide treatment, support and care services for people who are in need of nursing care due to the effects of ageing, injury, illness or other physical or mental impairment, or potential risks to health, according to the practice and standards of modern nursing. They assume responsibility for the planning and management of the care of patients, including the supervision of other health care workers, working autonomously or in teams with medical doctors and others in the practical application of preventive and curative measures in clinical and community settings."
                            }
                        ]
                    },
                    {
                        "code": "CHE.NAP",
                        "display": "Nursing associated professionals",
                        "designation": [
                            {
                                "value": "Nursing associate professionals provide basic nursing and personal care for people in need of such care due to effects of ageing, illness, injury, or other physical or mental impairment. They provide health advice to patients and families; monitor patients' conditions; and implement care, treatment and referral plans usually established by medical, nursing and other health professionals."
                            }
                        ]
                    },
                    {
                        "code": "CHE.MP",
                        "display": "Midwifery professionals",
                        "designation": [
                            {
                                "value": "Nursing associate professionals provide basic nursing and personal care for people in need of such care due to effects of ageing, illness, injury, or other physical or mental impairment. They provide health advice to patients and families; monitor patients' conditions; and implement care, treatment and referral plans usually established by medical, nursing and other health professionals."
                            }
                        ]
                    },
                    {
                        "code": "CHE.MAP",
                        "display": "Midwifery associated professionals",
                        "designation": [
                            {
                                "value": "Midwifery associate professionals provide basic health care and advice before, during and after pregnancy and childbirth. They provide advice to women, families and communities on birth and emergency plans, breastfeeding, infant care, family planning and related topics; monitor health status during pregnancy and childbirth; and implement care, treatment and referral plans usually established by medical, midwifery and other health professionals."
                            }
                        ]
                    },
                    {
                        "code": "CHE.MA",
                        "display": "Medical assistants",
                        "designation": [
                            {
                                "value": "Medical assistants perform basic clinical and administrative tasks to support patient care under the direct supervision of a medical practitioner or other health professional. They perform routine tasks and procedures such as measuring patients' vital signs, administering medications and injections, recording information in medical record-keeping systems, preparing and handling medical instruments and supplies, and collecting and preparing specimens of bodily fluids and tissues for laboratory testing."
                            }
                        ]
                    },
                    {
                        "code": "CHE.HCA",
                        "display": "Healthcare assistant",
                        "designation": [
                            {
                                "value": "Health care assistants provide routine personal care, support and assistance with activities of daily living to patients and residents in a variety of health care settings such as hospitals, clinics and residential nursing care facilities. They assist patients with personal, physical mobility and therapeutic care needs as per established care plans and practices, and generally under the direct supervision of medical, nursing or other health professionals or associate professionals."
                            }
                        ]
                    },
                    {
                        "code": "CHE.CHW",
                        "display": "Community healthcare workers",
                        "designation": [
                            {
                                "value": "Community health workers provide health education, referral and follow up, case management, and basic preventive health care and home visiting services to specific communities. They provide support and assistance to individuals and families in navigating the health and social services system."
                            }
                        ]
                    },
                    {
                        "code": "CHE.HBPCW",
                        "display": "Home-based personal care workers",
                        "designation": [
                            {
                                "value": "Home-based personal care workers provide routine personal care, support and assistance with activities of daily living to persons who are in need of such care due to effects of ageing, illness, injury, or other physical or mental condition in private homes and other independent residential settings. They assist clients with personal, physical mobility and therapeutic care needs, usually as per care plans established by a health professional."
                            }
                        ]
                    },
                    {
                        "code": "CHE.ICC",
                        "display": "Infant / child care",
                        "designation": [
                            {
                                "value": "A person who gives care to an infant / child and can be considered the Mother, Father, Adolescent Mother, Adolescent Father, Guardian, Carer of the Infant / Child.  They are the secondary clients receiving health care services from the targeted health worker personas with respect to their infant/child. While this is a diverse population group with different demographics, and health needs, they generally have the following expectations:\n• maintaining a healthy life for the infant / child (including preventing and treating risks, illness and death)\n• maintaining physical and socio-cultural normality for the infant / child\n• achieving positive infant/child health \nThe content specifications for children and their carers will become even more important as additional client-side digital functionalities, such as targeted client communication (reminders), reporting of health system feedback, and personal health tracking, are incorporated."
                            }
                        ]
                    },
                    {
                        "code": "CHE.MS",
                        "display": "Medical secretaries",
                        "designation": [
                            {
                                "value": "Medical secretaries, using specialized knowledge of medical terminology and health care delivery procedures, perform a variety of communication, documentation, administrative and internal coordination functions, to support health workers in medical facilities and other health care-related organizations. They sEm Careule medical appointments, record and review medical charts and correspondence, interview patients to complete case histories, prepare health insurance claims and acquisition orders, and supervise the work of other office support workers."
                            }
                        ]
                    },
                    {
                        "code": "CHE.CSW",
                        "display": "Clerical support workers",
                        "designation": [
                            {
                                "value": "This group covers clerical support workers (excluding specialized health information technicians and medical secretaries) working in health systems including, for instance, general clerks, keyboard clerks, client services clerks, material recording clerks and others who record, organize, store, compute and retrieve information, and perform clerical and secretarial duties in connection with money-handling operations, requests for information and appointments."
                            }
                        ]
                    },
                    {
                        "code": "CHE.HSM",
                        "display": "Health service managers",
                        "designation": [
                            {
                                "value": "Health service managers plan, direct, coordinate and evaluate the provision of clinical and community health care services in hospitals, clinics, public health agencies and similar organizations. They provide overall direction, policy standards and operational criteria for the units they manage, including supervising and evaluating the recruitment, training and work activities of personnel. They monitor the use of health services and resources. They liaise with other health and welfare service providers, boards and funding bodies to coordinate the provision of services."
                            }
                        ]
                    },
                    {
                        "code": "CHE.HMPNEC",
                        "display": "Health management personnel not elsewhere classified",
                        "designation": [
                            {
                                "value": "This group covers managers and administrators not classified elsewhere (except health service mangers) working in health systems including, for instance, government health department heads, human resource managers, supply chain managers, regional health policy and planning directors, and others whose main tasks and duties include guiding and directing the activities of organizations, departments and other workers."
                            }
                        ]
                    },
                    {
                        "code": "CHE.MRAHIT",
                        "display": "Medical record and health information technicians",
                        "designation": [
                            {
                                "value": "Medical records and health information technicians develop, implement and assess health records processing, storage and retrieval systems in medical facilities and other health care settings to meet the legal, professional, ethical and administrative records-keeping requirements of health services delivery."
                            }
                        ]
                    }
                ]
            }
        ]
    }
}